[
      {
    "company": "University of South Alabama, School of Computing",
    "position": "LLM XAI Undergraduate Researcher",
    "imageSrc": "experiences/usa.png",
    "location": "Mobile, AL",
    "duration": "May 2025 - Present",
    "details": "Conduct experiments on growing-self organizing maps and compare an artificial intelligence interpretation to a human’s. Construct and run test scripts with ChatGPT 5 to automate analysis from given global explanations, datasets, and graphs. Co-author a research paper based on academic findings, scheduled for publication and presentation at an upcoming conference."
  },
  {
    "company": "Extern",
    "position": "Beats by Dre Data Analytics: Qualitative & Quantitative Insights",
    "imageSrc": "experiences/extern.png",
    "location": "Remote",
    "duration": "Jun - Sep 2025",
    "details": "Generated critical customer insights on Gen Z trends and preferences for audio devices by conducting comprehensive qualitative and quantitative research, informing the development of future product marketing strategies. Executed advanced sentiment analysis on consumer feedback using Python, data science libraries, and Gemini AI's NLP capabilities across multiple audio device brands, leading to the identification of two key untapped market opportunities. Synthesized complex data findings into a detailed dashboard and visual presentations for leadership, providing actionable business strategies that influenced product positioning and competitive analysis."
  },
  {
    "company": "Extern",
    "position": "Outamation: Advanced AI-Powered Document Insights and Data Extraction",
    "imageSrc": "experiences/extern.png",
    "location": "Remote",
    "duration": "Sep - Dec 2025",
    "details": "Engineered AI-powered modular pipelines to process mortgage documents resulting in an estimated 65% reduction in manual processing time per file by fully automating core data extraction and classification tasks. Drove the end-to-end evaluation of the intelligence system, rigorously benchmarking OCR accuracy and RAG retrieval quality, and produced a technical report that informed final model trade-offs and guided a successful deployment strategy. Developed an interactive UI for the prototype system to facilitate demos and stakeholder reviews."
  }
]
